[
  {
    "id": "chiara-bartolozzi-2024-talk1",
    "speaker": {
      "name": "Dr. Chiara Bartolozzi",
      "title": "Senior Tenured Researcher",
      "affiliation": "Italian Institute of Technology (IIT)",
      "website": "https://www.iit.it/people-details/-/people/chiara-bartolozzi",
      "photo": "seminars/past/Chiara Bartolozzi/Chiara.png",
      "bio": "Dr. Chiara Bartolozzi is a Senior Tenured Researcher at the Italian Institute of Technology, leading the Event-Driven Perception for Robotics group. She earned her degree in Engineering from the University of Genova and a Ph.D. in Neuroinformatics from ETH Zurich. Her research focuses on neuromorphic engineering approaches to robotics, particularly event-driven sensing and processing. She coordinated the H2020 MSCA-ETN 'NeuTouch' and FP7 FET 'eMorph' projects, and serves as Senior Editor for NPJ Robotics and IOP Neuromorphic Computing and Engineering."
    },
    "title": "Neuromorphic Engineering and Event-Driven Perception for Robotics",
    "type": "Online Lecture",
    "abstract": "This talk explores the application of neuromorphic engineering principles to robotics through event-driven sensing and processing paradigms. Dr. Bartolozzi will discuss how neuromorphic approaches enable more efficient and bio-inspired perception systems for autonomous robots, with particular emphasis on tactile sensing and event-based vision. The presentation will cover recent advances in the NeuTouch project and demonstrate how event-driven perception can transform robotic capabilities in real-world scenarios.",
    "pdfPath": "seminars/past/Chiara Bartolozzi/Online Lecture- Dr Chiara Bartolozzi.pdf",
    "youtube": "",
    "date": "2024-10-28",
    "time": "9:00-10:30 JST"
  },
  {
    "id": "quan-luu-2024-talk1",
    "speaker": {
      "name": "Dr. Quan Luu",
      "title": "Postdoctoral Researcher",
      "affiliation": "Purdue University",
      "website": "https://quan-luu.github.io",
      "photo": "seminars/past/Quan Luu/QuanLuu_photo.png",
      "bio": "His research interests lie in creating soft and sensorized multimodal robotic bodies, especially those with a sense of touch, and leveraging them in robot learning and control systems. His work aims to enable robots to perform skilled and flexible manipulation, particularly in scenarios where contact and safe interaction with objects and surroundings are crucial."
    },
    "title": "Trends, Challenges, and Outlook in Robot Learning: Toward Safe and Generalizable Robots Through Multimodal Cross-Embodiment Learning",
    "type": "Online Lecture",
    "abstract": "Robot learning has advanced rapidly with progress in large-scale imitation learning, reinforcement learning, and vision–language–action (VLA) models, enabling robots to perceive and act more effectively in unstructured environments. However, achieving safe and generalizable behaviors across diverse tasks and embodiments remains a major challenge. This talk will review recent trends in learning paradigms, scalable data collection, and foundation models, highlighting challenges in data diversity, embodiment transfer, safety, and robustness. I will also share an outlook on multimodal cross-embodiment learning—integrating novel robotic devices with hierarchical strategies from low-level control to high-level reasoning—as a pathway toward safe, adaptive, and generalizable robot systems.",
    "pdfPath": "seminars/past/Quan Luu/invited talk Quan Luu.pdf",
    "youtube": "https://www.youtube.com/watch?v=example",
    "date": "2024-10-15",
    "time": "9:00-10:30 JST"
  }
]
